# Handlers


# delete_questionnaire handlers

tdelet1 = 'Анкета видалена! Сподіваюсь ми вам допомогли. Ви можете відновити свою анкету у будь-який час.'
tdelet2 = 'Cкільки тобі років?'

# edit handlers

tedit1 = 'Хто ти?'
tedit2 = 'Вік повинен бути вказаний числом'
tedit3 = 'Як тебе можна називати'
tedit4 = 'Звідки ти?'
tedit5 = 'Хто тебе цікавить?🤓'
tedit6 = 'Вибери місто із списку'
tedit7 = 'Розкажи щось про себе. Чим займаєшся? Яке твоє хобі? Скільки кубків в бравл старс? Будь оригінальним'
tedit8 = 'Відправ фото яке хочеш представити у своїй анкеті'
tedit9 = 'Ось твоя анкета:\n\n'
tedit10 = 'Відправ нове фото'
tedit11 = 'Як найкраще розкажи про себе'
tedit12 = "Нове ім'я користувача встановлено"
tedit13 = 'Твоя нова анкета:\n\n'
# main_handlers

tmain1 = 'Ви заблоковані. Це рішення не підглядає оскарженню.'
tmain2 = 'Раді бачити вас знову. Бажаєте відновити вашу анкету?'
tmain3 = 'Привіт, що тебе цікавить сьогодні?'
tmain4 = 'Cкільки тобі років?'
tmain5 = 'Поки що немає користувачів які підходять вам'
tmain6 = '\n\nВін залишив повідомлення:'
tmain7 = "У вас поки що немає симпатій, ми сповістим вас як тільки вони з'являться"
tmain8 = f'Хелоу! Давай спершу зареєструєм твою анкету.\n\n{tmain4}'
tmain9 = 'Ви справді бажаєте видалити вашу анкету?'

no_username = "Ми помітили, що у вас не налаштоване ім'я користувача. Користувачі яким ви сподобалися не зможуть вам " \
              "написати. Щоб встановити його, перейдіть в 'Налаштування' -> 'Ім'я користувача', потім" \
              " перейдіть в 'Моя анкета' -> 'Редагувати мою анкету' -> 'Я змінив нікнейм'"

# questionnaire handlers

tfind1 = 'Ви уже відправляли симпатію цьому користувачеві'
tfind2 = 'Ви комусь сподобалися'
tfind3 = 'Введіть ваше повідомлення'
tfind4 = 'Скарга відправленна'
tfind5 = 'Що далі?'
tfind6 = 'Сталася помилка'
tfind7 = 'Повідомлення відправленно!'
tfind8 = 'Анкети закінчилися'

# Likelist

tlike1 = 'У вас взаємна симпатія з:\n\n'
tlike2 = 'Його телеграм: @'
tlike3 = 'Ось телеграм цього користувача: @'
tlike4 = '\nПриємного спілкування.'
tlike5 = 'У вас більше немає симпатій.'

# tfind1 = 'text'
# tfind2 = 'text'
# tfind3 = 'text'
# tfind4 = 'text'
# tfind5 = 'text'
# tfind6 = 'text'
# tfind7 = 'text'
# tfind8 = 'text'
# tfind9 = 'text'
# tfind10 = 'text'
